#include "maximumValue.h"

/**************************************************************************
功能：获取最大值
输入：u16任意长数组
输出：数组内最大值u16
时间：20190713  1218
作者：郭浩
**************************************************************************/
u16 maxValue(u16* a,int len)
{
	u16 temp,i;
	temp = a[0];
	
	for(i=0;i<len;i++)
	{
		if(a[i]>temp)
			temp = a[i];
	}
	return temp;
}

/**************************************************************************
功能：获取最小值
输入：u16任意长数组
输出：数组内最小值u16
时间：20190713  1218
作者：郭浩
**************************************************************************/
u16 minValue(u16* a,int len)
{
	u16 temp,i;
	temp = a[0];
	
	for(i=0;i<len;i++)
	{
		if(a[i]<temp)
			temp = a[i];
	}
	return temp;
}
